package collections.List;

public class LinkedList01 {
    public static void main(String[] args) {
        /**
         * LinkedList
         * 배열의 장단점
         * 장점 : 배열은 구조가 간단하고, 데이터를 읽는 데 걸리는 시간이 짧다.
         * 단점1 : 크기를 변경할 수 없다.
         * 변경해야 하는 경우 배열을 새로 만든 후 데이터를 복사해야 한다.
         * ex. 1.새로운 배열 생성 2.기존 배열에서 데이터 복제 3.배열의 참조 변경
         * 단점2 : 비 순차적인 데이터의 추가, 삭제에 시간이 많이 걸린다.
         * ex. size(5)인 배열의 3번인덱스를 삭제하게 되면 3번인덱스 이후 데이터들이 자리를 옮겨오기 때문
         * 그러나 순차적인 데이터 추가와 삭제는 빠르다.(마지막 요소를 삭제하게 되면 데이터들이 자리를 옮길 일이 없다)
         * LinkedList 를 이용해 배열의 단점을 보완.
         * 링크드리스트는 불연속적으로 존재하는 데이터를 연결
         * 배열은 각 요소가 연속적이다. 그렇기 때문에 다음 요소의 주소를 정확히 알 수 있다.
         * 링크드리스트는 불연속적이기 때문에 구조 변경에 유리하다.
         * 링크드리스트의 단점. 데이터의 접근성이 나쁘다.
         */

    }
}
